04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/membrane/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-2.5 -1.2 -3.0)
    ( 2.5 -1.2 -3.0)
    (-2.5  1.2 -3.0)
    ( 2.5  1.2 -3.0)

    (-2.5 -1.2  3.0)
    ( 2.5 -1.2  3.0)
    (-2.5  1.2  3.0)
    ( 2.5  1.2  3.0)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (50 24 60) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
}

boundary
(
);


// ************************************************************************* //
